controllers/BaseController.php

SELECT * FROM `category` WHERE `status`=1 ORDER BY `id` DESC
---
    public function init(){
        if (Functions::isMobile()){
            $this->layout = 'mobile';
        }

        $cache = Yii::$app->cache;
        $categories = $cache->get('categories_header');
        //$categories = false;
        if ($categories === false) {
            $categories = Category::find()->where(['status' => [STATUS_ACTIVE]])->orderBy(['id' => SORT_DESC])->asArray()->all();