controllers/SiteController.php

    public function actionIndex()
    {
        $cache = Yii::$app->cache;
        //dunghq - 180317 - cache category home
        $categories = false;
        $categories = $cache->get('categories_home');
        if ($categories === false) {
            $categories = Category::find()->where('status = ' . STATUS_ACTIVE . ' AND show_home > 0')->orderBy(['show_home' => SORT_ASC])->all();
---
SELECT * FROM `category` WHERE status = 1 AND show_home > 0 ORDER BY `show_home`

        //dunghq - 180317 - cache video home
        $videos = $cache->get('news_video_home');
        if ($videos === false) {
            $videos = News::find()
                ->where(['status' => NEWS_STATUS_PUBLISHED, 'show_home' => 1, 'type' => 2])
                ->orderBy(['publish_time' => SORT_DESC])
                ->limit(10)
                ->all();
---
SELECT * FROM `news` WHERE (`status`=2) AND (`show_home`=1) AND (`type`=2) ORDER BY `publish_time` DESC LIMIT 10