models/SiteConfig.php

    public static function getAll(){
        $data = SiteConfig::find()->all();
---
SELECT * FROM `site_config`